// Памятка по сохранению русификации комментариев в коде
// для показа на GitHub.h для файла с исходным кодом
// сформированным в MS Visual Studio

/*
Необходимо сохранить файл в кодировке
"Юникод (UTF-8, с сигнатурой), кодовая страница 65001"
Обратить внимание на наличие фразы: "с сигнатурой" !

Последовательность нажатия клавиш:

1. Вверху слева на главной панели окна MS Visual Studio нажать [Файл]

2. В открывшемся меню нажать [Сохранить как ...]

3. В открывшемся окне "Сохранить файл как" внизу справа,
   справа от клавиши [Сохранить][▼]
   нажать миникнопку с треугольником [▼]

4. В открывшемся меню нажать [Сохранить с кодировкой ...]

5. В открывшемся окне: "Подтвердить сохранение в виде"
   с сообщением: "<Файл> уже существует. Вы хотите заменить его?"
   Нажать клавишу [Да]

6. В открывшемся окне "Дополнительные параметры сохранения"
   справа от поля "Кодировка:" нажать на значок [˅]

7. В открывшемся меню выбрать значение:
   "Юникод (UTF-8, с сигнатурой), кодовая страница 65001"

8. Нажать клавишу [ОК]







*/